org/content.org
#+HUGO_SECTION: ./
#+HUGO_BASE_DIR: ../

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

** Colophon
:PROPERTIES:
:EXPORT_FILE_NAME: colophon
:END:

#+TOC: headlines 1

All of the content on this site is either my work or is in the public
domain. I designed and implemented the user interface and style
myself.

To make this project easier, and serve the website to you, I used a
stack of excellent tools.

*** Creating site content

**** GNU Emacs
In my opinion, the greatest text editor / integrated development
environment ever created. Finely honed and infinitely customizable.

**** Org Mode
A feature filled hierarchical document creation system for Emacs, and
the closest to perfect to do management you can get.

**** GIMP
High quality image editor and converter, used to alter or touch up
many of the images I use on the site.

**** Vivaldi
Great browser based on Chromium, used to assess the appearance of the
site and debug the interactions between HTML, CSS, and JS.

*** Generating the site

**** GNU Make
Extremely flexible system for creating recipes to build software. Used
to condense several useful operations into single commands.

**** GNU Emacs
Used as an Emacs Lisp interpreter, running the functions required to
have all my source files converted into HTML for Jekyll.

**** =ox-hugo=
Backend for the Org mode exporter that generates Markdown content
files with front matter for Hugo, from my Org files.

**** Hugo
Fast and flexible static site generator that assembles my HTML layouts
and my generated content files into a complete website.

*** Serving the site

**** Git
Universally used version control system, handles tracking changes and
pushing site updates to GitHub.

**** Magit
Fantastic interface to Git from within Emacs. Provides convenient
keybindings and useful information for all version control tasks.

**** GitHub
Free hosting of source repositories and static sites alike; simply the
best option available for this site.

*** Languages used

**** HTML5
HyperText Markup Language, the standard internet markup language.

**** CSS3
Cascading Style Sheets, the standard internet styling language.

**** JavaScript
The standard internet scripting language.

**** Go Templates
Hugo's template language; enables easy dynamic generation of static
content.

**** TOML
Markup language used for Hugo configuration, like setting sitewide
variables.

**** Emacs Lisp
Lisp dialect which describes much of Emacs functionality. Used to
write directives for the Org mode publisher.

**** Makefile
Simple declarative language used to automate software builds.

**** Zsh
Extension of the Bourne again shell, used for scripting.

**** English
Germanic language written with a simple alphabet. Used to express
ideas to others.


