content/colophon.md
+++
title = "Colophon"
author = ["Matthew Rothlisberger"]
lastmod = 2020-10-14T20:44:13-04:00
draft = false
weight = 2006
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [Creating site content](#creating-site-content)
- [Generating the site](#generating-the-site)
- [Serving the site](#serving-the-site)
- [Languages used](#languages-used)

</div>
<!--endtoc-->

All of the content on this site is either my work or is in the public
domain. I designed and implemented the user interface and style
myself.

To make this project easier, and serve the website to you, I used a
stack of excellent tools.


## Creating site content {#creating-site-content}


### GNU Emacs {#gnu-emacs}

In my opinion, the greatest text editor / integrated development
environment ever created. Finely honed and infinitely customizable.


### Org Mode {#org-mode}

A feature filled hierarchical document creation system for Emacs, and
the closest to perfect to do management you can get.


### GIMP {#gimp}

High quality image editor and converter, used to alter or touch up
many of the images I use on the site.


### Vivaldi {#vivaldi}

Great browser based on Chromium, used to assess the appearance of the
site and debug the interactions between HTML, CSS, and JS.


## Generating the site {#generating-the-site}


### GNU Make {#gnu-make}

Extremely flexible system for creating recipes to build software. Used
to condense several useful operations into single commands.


### GNU Emacs {#gnu-emacs}

Used as an Emacs Lisp interpreter, running the functions required to
have all my source files converted into HTML for Jekyll.


### `ox-hugo` {#ox-hugo}

Backend for the Org mode exporter that generates Markdown content
files with front matter for Hugo, from my Org files.


### Hugo {#hugo}

Fast and flexible static site generator that assembles my HTML layouts
and my generated content files into a complete website.


## Serving the site {#serving-the-site}


### Git {#git}

Universally used version control system, handles tracking changes and
pushing site updates to GitHub.


### Magit {#magit}

Fantastic interface to Git from within Emacs. Provides convenient
keybindings and useful information for all version control tasks.


### GitHub {#github}

Free hosting of source repositories and static sites alike; simply the
best option available for this site.


## Languages used {#languages-used}


### HTML5 {#html5}

HyperText Markup Language, the standard internet markup language.


### CSS3 {#css3}

Cascading Style Sheets, the standard internet styling language.


### JavaScript {#javascript}

The standard internet scripting language.


### Go Templates {#go-templates}

Hugo's template language; enables easy dynamic generation of static
content.


### TOML {#toml}

Markup language used for Hugo configuration, like setting sitewide
variables.


### Emacs Lisp {#emacs-lisp}

Lisp dialect which describes much of Emacs functionality. Used to
write directives for the Org mode publisher.


### Makefile {#makefile}

Simple declarative language used to automate software builds.


### Zsh {#zsh}

Extension of the Bourne again shell, used for scripting.


### English {#english}

Germanic language written with a simple alphabet. Used to express
ideas to others.
